/* automatically generated by rust-bindgen 0.69.5 */

pub const INFFL_AUTO: u32 = 1;
pub const INFFL_ALLASM: u32 = 2;
pub const INFFL_LOADIDC: u32 = 4;
pub const INFFL_NOUSER: u32 = 8;
pub const INFFL_READONLY: u32 = 16;
pub const INFFL_CHKOPS: u32 = 32;
pub const INFFL_NMOPS: u32 = 64;
pub const INFFL_GRAPH_VIEW: u32 = 128;
pub const LFLG_PC_FPP: u32 = 1;
pub const LFLG_PC_FLAT: u32 = 2;
pub const LFLG_64BIT: u32 = 4;
pub const LFLG_IS_DLL: u32 = 8;
pub const LFLG_FLAT_OFF32: u32 = 16;
pub const LFLG_MSF: u32 = 32;
pub const LFLG_WIDE_HBF: u32 = 64;
pub const LFLG_DBG_NOPATH: u32 = 128;
pub const LFLG_SNAPSHOT: u32 = 256;
pub const LFLG_PACK: u32 = 512;
pub const LFLG_COMPRESS: u32 = 1024;
pub const LFLG_KERNMODE: u32 = 2048;
pub const AF_CODE: u32 = 1;
pub const AF_MARKCODE: u32 = 2;
pub const AF_JUMPTBL: u32 = 4;
pub const AF_PURDAT: u32 = 8;
pub const AF_USED: u32 = 16;
pub const AF_UNK: u32 = 32;
pub const AF_PROCPTR: u32 = 64;
pub const AF_PROC: u32 = 128;
pub const AF_FTAIL: u32 = 256;
pub const AF_LVAR: u32 = 512;
pub const AF_STKARG: u32 = 1024;
pub const AF_REGARG: u32 = 2048;
pub const AF_TRACE: u32 = 4096;
pub const AF_VERSP: u32 = 8192;
pub const AF_ANORET: u32 = 16384;
pub const AF_MEMFUNC: u32 = 32768;
pub const AF_TRFUNC: u32 = 65536;
pub const AF_STRLIT: u32 = 131072;
pub const AF_CHKUNI: u32 = 262144;
pub const AF_FIXUP: u32 = 524288;
pub const AF_DREFOFF: u32 = 1048576;
pub const AF_IMMOFF: u32 = 2097152;
pub const AF_DATOFF: u32 = 4194304;
pub const AF_FLIRT: u32 = 8388608;
pub const AF_SIGCMT: u32 = 16777216;
pub const AF_SIGMLT: u32 = 33554432;
pub const AF_HFLIRT: u32 = 67108864;
pub const AF_JFUNC: u32 = 134217728;
pub const AF_NULLSUB: u32 = 268435456;
pub const AF_DODATA: u32 = 536870912;
pub const AF_DOCODE: u32 = 1073741824;
pub const AF_FINAL: u32 = 2147483648;
pub const AF2_DOEH: u32 = 1;
pub const AF2_DORTTI: u32 = 2;
pub const AF2_MACRO: u32 = 4;
pub const AF2_MERGESTR: u32 = 8;
pub const SW_SEGXRF: u32 = 1;
pub const SW_XRFMRK: u32 = 2;
pub const SW_XRFFNC: u32 = 4;
pub const SW_XRFVAL: u32 = 8;
pub type uchar = ::std::os::raw::c_uchar;
pub type comp_t = uchar;
pub type cm_t = uchar;
#[doc = " Information about the target compiler"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct compiler_info_t {
    #[doc = "< compiler id (see \\ref COMP_)"]
    pub id: comp_t,
    #[doc = "< memory model and calling convention (see \\ref CM_)"]
    pub cm: cm_t,
    #[doc = "< sizeof(int)"]
    pub size_i: uchar,
    #[doc = "< sizeof(bool)"]
    pub size_b: uchar,
    #[doc = "< sizeof(enum)"]
    pub size_e: uchar,
    #[doc = "< default alignment for structures"]
    pub defalign: uchar,
    #[doc = "< short"]
    pub size_s: uchar,
    #[doc = "< long"]
    pub size_l: uchar,
    #[doc = "< longlong"]
    pub size_ll: uchar,
    #[doc = "< longdouble (if different from \\ph{tbyte_size})"]
    pub size_ldbl: uchar,
}
const _: () = {
    ["Size of compiler_info_t"][::std::mem::size_of::<compiler_info_t>() - 10usize];
    ["Alignment of compiler_info_t"][::std::mem::align_of::<compiler_info_t>() - 1usize];
    ["Offset of field: compiler_info_t::id"][::std::mem::offset_of!(compiler_info_t, id) - 0usize];
    ["Offset of field: compiler_info_t::cm"][::std::mem::offset_of!(compiler_info_t, cm) - 1usize];
    ["Offset of field: compiler_info_t::size_i"]
        [::std::mem::offset_of!(compiler_info_t, size_i) - 2usize];
    ["Offset of field: compiler_info_t::size_b"]
        [::std::mem::offset_of!(compiler_info_t, size_b) - 3usize];
    ["Offset of field: compiler_info_t::size_e"]
        [::std::mem::offset_of!(compiler_info_t, size_e) - 4usize];
    ["Offset of field: compiler_info_t::defalign"]
        [::std::mem::offset_of!(compiler_info_t, defalign) - 5usize];
    ["Offset of field: compiler_info_t::size_s"]
        [::std::mem::offset_of!(compiler_info_t, size_s) - 6usize];
    ["Offset of field: compiler_info_t::size_l"]
        [::std::mem::offset_of!(compiler_info_t, size_l) - 7usize];
    ["Offset of field: compiler_info_t::size_ll"]
        [::std::mem::offset_of!(compiler_info_t, size_ll) - 8usize];
    ["Offset of field: compiler_info_t::size_ldbl"]
        [::std::mem::offset_of!(compiler_info_t, size_ldbl) - 9usize];
};
#[doc = " \\defgroup CM_ptr Default pointer size\n@{"]
pub const CM_MASK: cm_t = 3;
#[doc = "< unknown"]
pub const CM_UNKNOWN: cm_t = 0;
#[doc = "< if sizeof(int)<=2: near 1 byte, far 2 bytes"]
pub const CM_N8_F16: cm_t = 1;
#[doc = "< if sizeof(int)>2: near 8 bytes, far 8 bytes"]
pub const CM_N64: cm_t = 1;
#[doc = "< near 2 bytes, far 4 bytes"]
pub const CM_N16_F32: cm_t = 2;
#[doc = "< near 4 bytes, far 6 bytes"]
pub const CM_N32_F48: cm_t = 3;
#[doc = "@}\n \\defgroup CM_M_ Model\n@{"]
pub const CM_M_MASK: cm_t = 12;
#[doc = "< small:   code=near, data=near (or unknown if CM_UNKNOWN)"]
pub const CM_M_NN: cm_t = 0;
#[doc = "< large:   code=far, data=far"]
pub const CM_M_FF: cm_t = 4;
#[doc = "< compact: code=near, data=far"]
pub const CM_M_NF: cm_t = 8;
#[doc = "< medium:  code=far, data=near"]
pub const CM_M_FN: cm_t = 12;
#[doc = " \\defgroup CM_CC_ Calling convention\n@{"]
pub const CM_CC_MASK: cm_t = 240;
#[doc = "< this value is invalid"]
pub const CM_CC_INVALID: cm_t = 0;
#[doc = "< unknown calling convention"]
pub const CM_CC_UNKNOWN: cm_t = 16;
#[doc = "< function without arguments\n< if has other cc and argnum == 0,\n< represent as f() - unknown list"]
pub const CM_CC_VOIDARG: cm_t = 32;
#[doc = "< stack"]
pub const CM_CC_CDECL: cm_t = 48;
#[doc = "< cdecl + ellipsis"]
pub const CM_CC_ELLIPSIS: cm_t = 64;
#[doc = "< stack, purged"]
pub const CM_CC_STDCALL: cm_t = 80;
#[doc = "< stack, purged, reverse order of args"]
pub const CM_CC_PASCAL: cm_t = 96;
#[doc = "< stack, purged (x86), first args are in regs (compiler-dependent)"]
pub const CM_CC_FASTCALL: cm_t = 112;
#[doc = "< stack, purged (x86), first arg is in reg (compiler-dependent)"]
pub const CM_CC_THISCALL: cm_t = 128;
#[doc = "< (Swift) arguments and return values in registers (compiler-dependent)"]
pub const CM_CC_SWIFT: cm_t = 144;
#[doc = "< This is NOT a cc! Mark of __spoil record\n< the low nibble is count and after n {spoilreg_t}\n< present real cm_t byte. if n == BFA_FUNC_MARKER,\n< the next byte is the function attribute byte."]
pub const CM_CC_SPOILED: cm_t = 160;
#[doc = "< (Go) arguments and return value in stack"]
pub const CM_CC_GOLANG: cm_t = 176;
pub const CM_CC_RESERVE3: cm_t = 192;
#[doc = "< ::CM_CC_SPECIAL with ellipsis"]
pub const CM_CC_SPECIALE: cm_t = 208;
#[doc = "< Equal to ::CM_CC_SPECIAL, but with purged stack"]
pub const CM_CC_SPECIALP: cm_t = 224;
#[doc = "< usercall: locations of all arguments\n< and the return value are explicitly specified"]
pub const CM_CC_SPECIAL: cm_t = 240;
#[doc = " \\defgroup COMP_ Compiler IDs\n@{"]
pub const COMP_MASK: comp_t = 15;
#[doc = "< Unknown"]
pub const COMP_UNK: comp_t = 0;
#[doc = "< Visual C++"]
pub const COMP_MS: comp_t = 1;
#[doc = "< Borland C++"]
pub const COMP_BC: comp_t = 2;
#[doc = "< Watcom C++"]
pub const COMP_WATCOM: comp_t = 3;
#[doc = "< GNU C++"]
pub const COMP_GNU: comp_t = 6;
#[doc = "< Visual Age C++"]
pub const COMP_VISAGE: comp_t = 7;
#[doc = "< Delphi"]
pub const COMP_BP: comp_t = 8;
#[doc = "< uncertain compiler id"]
pub const COMP_UNSURE: comp_t = 128;
