/* automatically generated by rust-bindgen 0.69.5 */

pub const OF_NO_BASE_DISP: u32 = 128;
pub const OF_OUTER_DISP: u32 = 64;
pub const OF_NUMBER: u32 = 16;
pub const OF_SHOW: u32 = 8;
pub type uchar = ::std::os::raw::c_uchar;
pub type uint8 = ::std::os::raw::c_uchar;
pub type int16 = ::std::os::raw::c_short;
pub type uint16 = ::std::os::raw::c_ushort;
pub type uint32 = ::std::os::raw::c_uint;
pub type uint64 = ::std::os::raw::c_ulonglong;
pub type ea_t = uint64;
pub type asize_t = uint64;
pub type uval_t = asize_t;
pub type op_dtype_t = uint8;
#[doc = " \\defgroup operands Operands\n Work with instruction operands"]
pub type optype_t = uchar;
#[doc = " Operand of an instruction. \\ingroup operands_t\n This structure is filled by the analyzer.\n Upon entrance to the analyzer, some fields of this structure are initialized:\n   - #type:    ::o_void\n   - #offb:    0\n   - #offo:    0\n   - #flags:   #OF_SHOW"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct op_t {
    #[doc = " Number of operand (0,1,2). Initialized once at the start of work.\n You have no right to change its value."]
    pub n: uchar,
    #[doc = " Type of operand (see \\ref o_)"]
    pub type_: optype_t,
    #[doc = " Offset of operand value from the instruction start (0 means unknown).\n Of course this field is meaningful only for certain types of operands.\n Leave it equal to zero if the operand has no offset.\n This offset should point to the 'interesting' part of operand.\n For example, it may point to the address of a function in\n      \\v{call func}\n or it may point to bytes holding '5' in\n      \\v{mov  ax, [bx+5]}\n Usually bytes pointed to this offset are relocated (have fixup information)."]
    pub offb: ::std::os::raw::c_char,
    #[doc = " Same as #offb (some operands have 2 numeric values used to form an operand).\n This field is used for the second part of operand if it exists.\n Currently this field is used only for outer offsets of Motorola processors.\n Leave it equal to zero if the operand has no offset."]
    pub offo: ::std::os::raw::c_char,
    #[doc = "< \\ref OF_"]
    pub flags: uchar,
    #[doc = " Type of operand value (see \\ref dt_). Usually first 9 types are used.\n This is the type of the operand itself, not the size of the addressing mode.\n for example, byte ptr [epb+32_bit_offset]  will have #dt_byte type."]
    pub dtype: op_dtype_t,
    pub __bindgen_anon_1: op_t__bindgen_ty_1,
    pub __bindgen_anon_2: op_t__bindgen_ty_2,
    pub __bindgen_anon_3: op_t__bindgen_ty_3,
    pub __bindgen_anon_4: op_t__bindgen_ty_4,
    #[doc = " \\name Special flags\n The following fields are used only in idp modules.\n You may use them as you want to store additional information about\n the operand.\n@{"]
    pub specflag1: ::std::os::raw::c_char,
    pub specflag2: ::std::os::raw::c_char,
    pub specflag3: ::std::os::raw::c_char,
    pub specflag4: ::std::os::raw::c_char,
}
#[doc = "@}"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union op_t__bindgen_ty_1 {
    #[doc = "< number of register (::o_reg)"]
    pub reg: uint16,
    #[doc = "< number of register phrase (::o_phrase,::o_displ).\n< you yourself define numbers of phrases\n< as you like"]
    pub phrase: uint16,
}
const _: () = {
    ["Size of op_t__bindgen_ty_1"][::std::mem::size_of::<op_t__bindgen_ty_1>() - 2usize];
    ["Alignment of op_t__bindgen_ty_1"][::std::mem::align_of::<op_t__bindgen_ty_1>() - 2usize];
    ["Offset of field: op_t__bindgen_ty_1::reg"]
        [::std::mem::offset_of!(op_t__bindgen_ty_1, reg) - 0usize];
    ["Offset of field: op_t__bindgen_ty_1::phrase"]
        [::std::mem::offset_of!(op_t__bindgen_ty_1, phrase) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union op_t__bindgen_ty_2 {
    #[doc = "< operand value (::o_imm) or\n< outer displacement (::o_displ+#OF_OUTER_DISP).\n< integer values should be in IDA's (little-endian) order.\n< when using ieee_realcvt(), floating point values should be in the processor's native byte order.\n< #dt_double and #dt_qword values take up 8 bytes (value and addr fields for 32-bit modules).\n< NB: in case a #dt_dword/#dt_qword immediate is forced to float by user,\n< the kernel converts it to processor's native order before calling FP conversion routines."]
    pub value: uval_t,
    pub value_shorts: op_t__bindgen_ty_2__bindgen_ty_1,
}
#[doc = " This structure is defined for\n your convenience only"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct op_t__bindgen_ty_2__bindgen_ty_1 {
    pub low: uint16,
    pub high: uint16,
}
const _: () = {
    ["Size of op_t__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::size_of::<op_t__bindgen_ty_2__bindgen_ty_1>() - 4usize];
    ["Alignment of op_t__bindgen_ty_2__bindgen_ty_1"]
        [::std::mem::align_of::<op_t__bindgen_ty_2__bindgen_ty_1>() - 2usize];
    ["Offset of field: op_t__bindgen_ty_2__bindgen_ty_1::low"]
        [::std::mem::offset_of!(op_t__bindgen_ty_2__bindgen_ty_1, low) - 0usize];
    ["Offset of field: op_t__bindgen_ty_2__bindgen_ty_1::high"]
        [::std::mem::offset_of!(op_t__bindgen_ty_2__bindgen_ty_1, high) - 2usize];
};
const _: () = {
    ["Size of op_t__bindgen_ty_2"][::std::mem::size_of::<op_t__bindgen_ty_2>() - 8usize];
    ["Alignment of op_t__bindgen_ty_2"][::std::mem::align_of::<op_t__bindgen_ty_2>() - 8usize];
    ["Offset of field: op_t__bindgen_ty_2::value"]
        [::std::mem::offset_of!(op_t__bindgen_ty_2, value) - 0usize];
    ["Offset of field: op_t__bindgen_ty_2::value_shorts"]
        [::std::mem::offset_of!(op_t__bindgen_ty_2, value_shorts) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union op_t__bindgen_ty_3 {
    #[doc = "< virtual address pointed or used by the operand.\n< (::o_mem,::o_displ,::o_far,::o_near)"]
    pub addr: ea_t,
    pub addr_shorts: op_t__bindgen_ty_3__bindgen_ty_1,
}
#[doc = " This structure is defined for\n your convenience only"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct op_t__bindgen_ty_3__bindgen_ty_1 {
    pub low: uint16,
    pub high: uint16,
}
const _: () = {
    ["Size of op_t__bindgen_ty_3__bindgen_ty_1"]
        [::std::mem::size_of::<op_t__bindgen_ty_3__bindgen_ty_1>() - 4usize];
    ["Alignment of op_t__bindgen_ty_3__bindgen_ty_1"]
        [::std::mem::align_of::<op_t__bindgen_ty_3__bindgen_ty_1>() - 2usize];
    ["Offset of field: op_t__bindgen_ty_3__bindgen_ty_1::low"]
        [::std::mem::offset_of!(op_t__bindgen_ty_3__bindgen_ty_1, low) - 0usize];
    ["Offset of field: op_t__bindgen_ty_3__bindgen_ty_1::high"]
        [::std::mem::offset_of!(op_t__bindgen_ty_3__bindgen_ty_1, high) - 2usize];
};
const _: () = {
    ["Size of op_t__bindgen_ty_3"][::std::mem::size_of::<op_t__bindgen_ty_3>() - 8usize];
    ["Alignment of op_t__bindgen_ty_3"][::std::mem::align_of::<op_t__bindgen_ty_3>() - 8usize];
    ["Offset of field: op_t__bindgen_ty_3::addr"]
        [::std::mem::offset_of!(op_t__bindgen_ty_3, addr) - 0usize];
    ["Offset of field: op_t__bindgen_ty_3::addr_shorts"]
        [::std::mem::offset_of!(op_t__bindgen_ty_3, addr_shorts) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union op_t__bindgen_ty_4 {
    #[doc = "< This field may be used as you want."]
    pub specval: ea_t,
    pub specval_shorts: op_t__bindgen_ty_4__bindgen_ty_1,
}
#[doc = " This structure is defined for\n your convenience only"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct op_t__bindgen_ty_4__bindgen_ty_1 {
    #[doc = "< IBM PC: segment register number (::o_mem,::o_far,::o_near)"]
    pub low: uint16,
    #[doc = "< IBM PC: segment selector value  (::o_mem,::o_far,::o_near)"]
    pub high: uint16,
}
const _: () = {
    ["Size of op_t__bindgen_ty_4__bindgen_ty_1"]
        [::std::mem::size_of::<op_t__bindgen_ty_4__bindgen_ty_1>() - 4usize];
    ["Alignment of op_t__bindgen_ty_4__bindgen_ty_1"]
        [::std::mem::align_of::<op_t__bindgen_ty_4__bindgen_ty_1>() - 2usize];
    ["Offset of field: op_t__bindgen_ty_4__bindgen_ty_1::low"]
        [::std::mem::offset_of!(op_t__bindgen_ty_4__bindgen_ty_1, low) - 0usize];
    ["Offset of field: op_t__bindgen_ty_4__bindgen_ty_1::high"]
        [::std::mem::offset_of!(op_t__bindgen_ty_4__bindgen_ty_1, high) - 2usize];
};
const _: () = {
    ["Size of op_t__bindgen_ty_4"][::std::mem::size_of::<op_t__bindgen_ty_4>() - 8usize];
    ["Alignment of op_t__bindgen_ty_4"][::std::mem::align_of::<op_t__bindgen_ty_4>() - 8usize];
    ["Offset of field: op_t__bindgen_ty_4::specval"]
        [::std::mem::offset_of!(op_t__bindgen_ty_4, specval) - 0usize];
    ["Offset of field: op_t__bindgen_ty_4::specval_shorts"]
        [::std::mem::offset_of!(op_t__bindgen_ty_4, specval_shorts) - 0usize];
};
const _: () = {
    ["Size of op_t"][::std::mem::size_of::<op_t>() - 40usize];
    ["Alignment of op_t"][::std::mem::align_of::<op_t>() - 8usize];
    ["Offset of field: op_t::n"][::std::mem::offset_of!(op_t, n) - 0usize];
    ["Offset of field: op_t::type_"][::std::mem::offset_of!(op_t, type_) - 1usize];
    ["Offset of field: op_t::offb"][::std::mem::offset_of!(op_t, offb) - 2usize];
    ["Offset of field: op_t::offo"][::std::mem::offset_of!(op_t, offo) - 3usize];
    ["Offset of field: op_t::flags"][::std::mem::offset_of!(op_t, flags) - 4usize];
    ["Offset of field: op_t::dtype"][::std::mem::offset_of!(op_t, dtype) - 5usize];
    ["Offset of field: op_t::specflag1"][::std::mem::offset_of!(op_t, specflag1) - 32usize];
    ["Offset of field: op_t::specflag2"][::std::mem::offset_of!(op_t, specflag2) - 33usize];
    ["Offset of field: op_t::specflag3"][::std::mem::offset_of!(op_t, specflag3) - 34usize];
    ["Offset of field: op_t::specflag4"][::std::mem::offset_of!(op_t, specflag4) - 35usize];
};
#[doc = " Structure to hold information about an instruction. \\ingroup instruction\n This structure is filled by the analysis step of IDP and used by\n the emulation and conversion to text steps. The kernel uses this structure too.\n All structure fields except #cs, #ip, #ea, and op_t::n,op_t::flags of #ops\n are initialized to zero by the kernel. The rest should be filled by ana()."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct insn_t {
    #[doc = " Current segment base paragraph. Initialized by the kernel."]
    pub cs: ea_t,
    #[doc = " Virtual address of the instruction (address within the segment).\n Initialized by the kernel."]
    pub ip: ea_t,
    #[doc = " Linear address of the instruction.\n Initialized by the kernel."]
    pub ea: ea_t,
    #[doc = " Internal code of instruction (only for canonical insns - not user defined!).\n IDP should define its own instruction codes. These codes are usually\n defined in ins.hpp. The array of instruction names and features (ins.cpp)\n is accessed using this code."]
    pub itype: uint16,
    #[doc = " Size of instruction in bytes.\n The analyzer should put here the actual size of the instruction."]
    pub size: uint16,
    pub __bindgen_anon_1: insn_t__bindgen_ty_1,
    #[doc = "< processor dependent field"]
    pub segpref: ::std::os::raw::c_char,
    #[doc = "< processor dependent field"]
    pub insnpref: ::std::os::raw::c_char,
    #[doc = "< \\ref INSN_"]
    pub flags: int16,
    #[doc = "< array of operands"]
    pub ops: [op_t; 8usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union insn_t__bindgen_ty_1 {
    #[doc = "< processor dependent field"]
    pub auxpref: uint32,
    pub auxpref_u16: [uint16; 2usize],
    pub auxpref_u8: [uint8; 4usize],
}
const _: () = {
    ["Size of insn_t__bindgen_ty_1"][::std::mem::size_of::<insn_t__bindgen_ty_1>() - 4usize];
    ["Alignment of insn_t__bindgen_ty_1"][::std::mem::align_of::<insn_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: insn_t__bindgen_ty_1::auxpref"]
        [::std::mem::offset_of!(insn_t__bindgen_ty_1, auxpref) - 0usize];
    ["Offset of field: insn_t__bindgen_ty_1::auxpref_u16"]
        [::std::mem::offset_of!(insn_t__bindgen_ty_1, auxpref_u16) - 0usize];
    ["Offset of field: insn_t__bindgen_ty_1::auxpref_u8"]
        [::std::mem::offset_of!(insn_t__bindgen_ty_1, auxpref_u8) - 0usize];
};
const _: () = {
    ["Size of insn_t"][::std::mem::size_of::<insn_t>() - 360usize];
    ["Alignment of insn_t"][::std::mem::align_of::<insn_t>() - 8usize];
    ["Offset of field: insn_t::cs"][::std::mem::offset_of!(insn_t, cs) - 0usize];
    ["Offset of field: insn_t::ip"][::std::mem::offset_of!(insn_t, ip) - 8usize];
    ["Offset of field: insn_t::ea"][::std::mem::offset_of!(insn_t, ea) - 16usize];
    ["Offset of field: insn_t::itype"][::std::mem::offset_of!(insn_t, itype) - 24usize];
    ["Offset of field: insn_t::size"][::std::mem::offset_of!(insn_t, size) - 26usize];
    ["Offset of field: insn_t::segpref"][::std::mem::offset_of!(insn_t, segpref) - 32usize];
    ["Offset of field: insn_t::insnpref"][::std::mem::offset_of!(insn_t, insnpref) - 33usize];
    ["Offset of field: insn_t::flags"][::std::mem::offset_of!(insn_t, flags) - 34usize];
    ["Offset of field: insn_t::ops"][::std::mem::offset_of!(insn_t, ops) - 40usize];
};
